In [1]:
import numpy as np
import pandas as pd

In [2]:
user_book = pd.read_csv("./Book_data/old_data/Ratings.csv")   # http://www2.informatik.uni-freiburg.de/~cziegler/BX/

In [3]:
user_book = user_book[(user_book["Book-Rating"] > 5) ]
user_book

         User-ID         ISBN  Book-Rating
4         276729   0521795028            6
6         276736   3257224281            8
7         276737   0600570967            6
8         276744   038550120X            7
9         276745    342310538           10
...          ...          ...          ...
1149771   276704   0743211383            7
1149775   276704   1563526298            9
1149777   276709   0515107662           10
1149778   276721   0590442449           10
1149779   276723  05162443314            8

[363268 rows x 3 columns]

In [4]:
user_ID = set()
book_ID = set()
for i in  user_book['User-ID']:
    user_ID.add(i)
for i in  user_book['ISBN']:
    book_ID.add(i)
print(len(user_ID), len(book_ID))
print("平均每个人交互的次数:",len(user_book )/len(user_ID))

69775 159323
平均每个人交互的次数: 5.206277319957005

In [5]:
books = pd.read_csv("./Book_data/old_data/Books.csv")
users = pd.read_csv("./Book_data/old_data/Users.csv")

D:\Programs\envs\pytorch\lib\site-packages\IPython\core\interactiveshell.py:3072: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

        User-ID                            Location   Age
0             1                  nyc, new york, usa   NaN
1             2           stockton, california, usa  18.0
2             3     moscow, yukon territory, russia   NaN
3             4           porto, v.n.gaia, portugal  17.0
4             5  farnborough, hants, united kingdom   NaN
...         ...                                 ...   ...
278853   278854               portland, oregon, usa   NaN
278854   278855  tacoma, washington, united kingdom  50.0
278855   278856           brampton, ontario, canada   NaN
278856   278857           knoxville, tennessee, usa   NaN
278857   278858                dublin, n/a, ireland   NaN

[278858 rows x 3 columns]

In [8]:
#  找出与用户交互过的书
books = books[books["ISBN"].isin(book_ID)]
users = users[users["User-ID"].isin(user_ID)]
print(len(users),len(books))
# len(books)  <  用户看过的   一部分用户交互过的书在books里没有，进一步处理

69775 129014

In [9]:
# 用户交互过的书
user_book = user_book[user_book["ISBN"].isin(books["ISBN"])]

In [11]:
user_ID = set()
book_ID = set()
for i in  user_book['User-ID']:
    user_ID.add(i)
for i in  user_book['ISBN']:
    book_ID.add(i)
print("用户数：%d, 书集数：%d, 交互数：%d" %(len(user_ID), len(book_ID), len(user_book)))
print("平均每个人交互的次数:",len(user_book ) /len(user_ID))
# 用户数：61288, 书集数：129014, 交互数：321896
# 平均每个人交互的次数: 5.252186398642475

用户数：61288, 书集数：129014, 交互数：321896
平均每个人交互的次数: 5.252186398642475

In [13]:
users = users[users["User-ID"].isin(user_ID)]
len(users)

61288

In [16]:
Ratings = "./Book_data/new_data/Ratings.csv"
Books = "./Book_data/new_data/Books.csv"
Users = "./Book_data/new_data/Users.csv"
user_book.to_csv(Ratings,sep=',', columns=None, header=True, index=False, mode='w', encoding=None)
books.to_csv(Books,sep=',', columns=None, header=True, index=False, mode='w', encoding=None)
users.to_csv(Users,sep=',', columns=None, header=True, index=False, mode='w', encoding=None)

In [18]:
pd.read_csv("./Book_data/new_data/Books.csv")
pd.read_csv("./Book_data/new_data/Users.csv")

D:\Programs\envs\pytorch\lib\site-packages\IPython\core\interactiveshell.py:3072: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

       User-ID                         Location   Age
0            8         timmins, ontario, canada   NaN
1            9       germantown, tennessee, usa   NaN
2           12      fort bragg, california, usa   NaN
3           14            mediapolis, iowa, usa   NaN
4           16     albuquerque, new mexico, usa   NaN
...        ...                              ...   ...
61283   278846         toronto, ontario, canada  23.0
61284   278849      georgetown, ontario, canada  23.0
61285   278851               dallas, texas, usa  33.0
61286   278852  brisbane, queensland, australia  32.0
61287   278854            portland, oregon, usa   NaN

[61288 rows x 3 columns]